package com.himedia.java;

// * 추상클래스(Abstract class)
// 추상 클래스는 인스턴스화할 수 없는 클래스이다.
// 즉 추상 클래스 자체로 객체를 생성할 수 없으며,
// 반드시 이 클래스를 상속받은 자식 클래스를 통해서만 객체를 생성할 수 있다.
// 추상 클래스는 추상 메서드뿐만 아니라 일반 메서드도 포함할 수 있으며,
// 필드(멤버 변수)를 가질 수도 있다.

// * 추상메서드(Abstract method)
// 추상 메서드는 메서드의 선언만 존재하고, 구현(메서드의 몸체)이 없는 메서드 이다.
// 추상 메서드는 추상 클래스 내에서 정의되며, 이 메서드를 상속받은 자식 클래스는
// 반드시 이 메서드를 오버라이딩하여 구현해야 한다.

// 추상 클래스와 추상 메서드는 주로 상속 관계에서 공통된 동작을 정의하고,
// 하위 클래스에서 구체적인 구현을 제공하도록 강제하는 데 사용된다.

public class L_abstract {
    public static void main(String[] args) {

    }
}
